Reports/ЖурналЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ЖурналЗакупок</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Поступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Поступления</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеоблагаемая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеоблагаемаяВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗачетНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗачетаНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПоступленияИтоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПоступленияИтоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакСтраны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСтраны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаФактурыПолученные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СчетаФактурыПолученные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеоблагаемая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСНеПодтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДПоИмпорту</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакСтраны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСтраны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЖурналЗакупок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Журнал закупок.'");

	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
		НСтр("ru = 'Дата СФ
		|Счет-фактура
		|Док. поставки
		|Дата поставки
		|Поставщик,ИНН
		|Наименование поставки
		|Сумма без НДС
		|НДС
		|Необл.сумма
		|Всего'");
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
		НСтр("ru = 'НачалоПериода
		|КонецПериода
		|СортировкаОтчета
		|ГруппировкаОтчета
		|Организация'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = НСтр("ru = 'Журнал закупок'");
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура формирования отчета.
//
// Параметры:
// ПараметрыОтчета - структура - набор параметров, необходимых для построения отчета.
// 	АдресХранилища - адрес временного хранилища.
Процедура Сформировать(СтруктураПараметров, АдресХранилища) Экспорт
	
	РезультатФормирования = Новый Структура("Результат, ОписаниеОшибки", Неопределено, "");
	СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования);
	ПоместитьВоВременноеХранилище(РезультатФормирования, АдресХранилища);
	
КонецПроцедуры

Процедура СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ЧерноБелаяПечать = Истина;
	
	Организация 	= СтруктураПараметров.Организация;
	НачалоПериода 	= НачалоМесяца(СтруктураПараметров.НачалоПериода);
	КонецПериода 	= КонецМесяца(СтруктураПараметров.КонецПериода);
	Сортировка 		= СтруктураПараметров.Сортировка;
	Группировка		= СтруктураПараметров.Группировка;
	
	// Опеределение макета
	Макет = ПолучитьМакет("ПФ_MXL_ЖурналЗакупок");
	
	// Заполнение шапки
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода);
	ТабличныйДокумент.Вывести(ОбластьШапка);	
			
	ОбластьШапкаТаблицы 		=  Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Реализация
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ОсновнойТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоступленияОбороты.Контрагент КАК Контрагент,
	|	ПоступленияОбороты.Контрагент.ИНН КАК КонтрагентИНН,
	|	ПоступленияОбороты.Контрагент.Наименование,
	|	ПоступленияОбороты.ПериодСекунда КАК ДатаПоставки,
	|	ЕСТЬNULL(СчетаФактурыПолученные.ДатаСФ, ПоступленияИтоги.ДатаСФ) КАК ДатаСФ,
	|	ЕСТЬNULL(ЕСТЬNULL(СчетаФактурыПолученные.СерияБланкаСФ, ПоступленияИтоги.СерияБланкаСФ), """") КАК СерияСФ,
	|	ЕСТЬNULL(ЕСТЬNULL(СчетаФактурыПолученные.НомерБланкаСФ, ПоступленияИтоги.НомерБланкаСФ), """") КАК НомерСФ,
	|	ПоступленияОбороты.Номенклатура,
	|	ПоступленияОбороты.ДокументПоступления КАК ДокументПоставки,
	|	""Ставка НДС: Стандарт"" КАК СтавкаНДССтрокой,
	|	ПоступленияОбороты.СуммаСебестоимостиОборот КАК СуммаБезНДС,
	|	ПоступленияОбороты.СуммаНДСОборот КАК СуммаНДС,
	|	ПоступленияОбороты.СуммаНеоблагаемаяОборот КАК СуммаНеоблагаемая,
	|	ПоступленияОбороты.СуммаСебестоимостиОборот + ПоступленияОбороты.СуммаНДСОборот + ПоступленияОбороты.СуммаНеоблагаемаяОборот КАК Всего,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ВременнаяТаблицаОбщая
	|ИЗ
	|	РегистрНакопления.Поступления.Обороты(&НачалоПериода, &КонецПериода, Авто, Организация = &Организация) КАК ПоступленияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоступленияИтоги КАК ПоступленияИтоги
	|		ПО (ПоступленияИтоги.ДокументПоступления = ПоступленияОбороты.ДокументПоступления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаФактурыПолученные КАК СчетаФактурыПолученные
	|		ПО (СчетаФактурыПолученные.Документ = ПоступленияОбороты.ДокументПоступления)
	|ГДЕ
	|	ПоступленияОбороты.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.Стандарт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступленияОбороты.Контрагент,
	|	ПоступленияОбороты.Контрагент.ИНН,
	|	ПоступленияОбороты.Контрагент.Наименование,
	|	ПоступленияОбороты.ПериодСекунда,
	|	ЕСТЬNULL(СчетаФактурыПолученные.ДатаСФ, ПоступленияИтоги.ДатаСФ),
	|	ЕСТЬNULL(ЕСТЬNULL(СчетаФактурыПолученные.СерияБланкаСФ, ПоступленияИтоги.СерияБланкаСФ), """"),
	|	ЕСТЬNULL(ЕСТЬNULL(СчетаФактурыПолученные.НомерБланкаСФ, ПоступленияИтоги.НомерБланкаСФ), """"),
	|	ПоступленияОбороты.Номенклатура,
	|	ПоступленияОбороты.ДокументПоступления,
	|	""Ставка НДС: Без НДС"",
	|	ПоступленияОбороты.СуммаСебестоимостиОборот,
	|	ПоступленияОбороты.СуммаНДСОборот,
	|	ПоступленияОбороты.СуммаНеоблагаемаяОборот,
	|	ПоступленияОбороты.СуммаСебестоимостиОборот + ПоступленияОбороты.СуммаНДСОборот + ПоступленияОбороты.СуммаНеоблагаемаяОборот,
	|	2
	|ИЗ
	|	РегистрНакопления.Поступления.Обороты(&НачалоПериода, &КонецПериода, Авто, Организация = &Организация) КАК ПоступленияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоступленияИтоги КАК ПоступленияИтоги
	|		ПО (ПоступленияИтоги.ДокументПоступления = ПоступленияОбороты.ДокументПоступления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаФактурыПолученные КАК СчетаФактурыПолученные
	|		ПО (СчетаФактурыПолученные.Документ = ПоступленияОбороты.ДокументПоступления)
	|ГДЕ
	|	ПоступленияОбороты.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОбщая.Порядок,
	|	ВременнаяТаблицаОбщая.Контрагент,
	|	ВременнаяТаблицаОбщая.КонтрагентНаименование + ВЫБОР
	|		КОГДА ВременнаяТаблицаОбщая.КонтрагентИНН = """"
	|			ТОГДА """"
	|		ИНАЧЕ "", ""
	|	КОНЕЦ + ВременнаяТаблицаОбщая.КонтрагентИНН КАК КонтрагентНаименованиеИНН,
	|	ВременнаяТаблицаОбщая.СерияСФ,
	|	ВременнаяТаблицаОбщая.НомерСФ,
	|	ВременнаяТаблицаОбщая.Номенклатура,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОбщая.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаОбщая.Номенклатура КАК Справочник.Номенклатура).Наименование
	|		КОГДА ВременнаяТаблицаОбщая.Номенклатура ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаОбщая.Номенклатура КАК Справочник.ОсновныеСредства).Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ПРЕДСТАВЛЕНИЕ(ВременнаяТаблицаОбщая.ДокументПоставки),
	|	ВременнаяТаблицаОбщая.СуммаБезНДС,
	|	ВременнаяТаблицаОбщая.СуммаНДС,
	|	ВременнаяТаблицаОбщая.СуммаНеоблагаемая,
	|	ВременнаяТаблицаОбщая.Всего,
	|	ВременнаяТаблицаОбщая.СтавкаНДССтрокой,
	|	ВременнаяТаблицаОбщая.ДатаСФ,
	|	ВременнаяТаблицаОбщая.ДатаПоставки,
	|	ВременнаяТаблицаОбщая.СерияСФ + ВЫБОР
	|		КОГДА ВременнаяТаблицаОбщая.СерияСФ = """"
	|			ТОГДА """"
	|		ИНАЧЕ "" № ""
	|	КОНЕЦ + ВременнаяТаблицаОбщая.НомерСФ КАК СчетФактура
	|ИЗ
	|	ВременнаяТаблицаОбщая КАК ВременнаяТаблицаОбщая";
		
	ТекстГруппировка = "";
	Если Сортировка = "По счет-фактуре" Тогда
		ТекстГруппировка = 
	    "
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	СерияБланкаСФ,
		|	НомерБланкаСФ";	
			
	ИначеЕсли Сортировка = "По контрагенту" Тогда
		ТекстГруппировка =
	    "
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,		
		|	Контрагент";	
	Иначе
		ТекстГруппировка =
	    "
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,		
		|	ДатаПоставки";	
	КонецЕсли;	
			
	Если Группировка = "По контрагенту" ИЛИ НЕ ЗначениеЗаполнено(Группировка) Тогда
		ТекстГруппировка = ТекстГруппировка + 
	    "
		|ИТОГИ
		|	СУММА(СуммаБезНДС),
		|	СУММА(СуммаНДС),
		|	СУММА(СуммаНеоблагаемая),
		|	СУММА(Всего)
		|ПО
		|	ОБЩИЕ,
		|	СтавкаНДССтрокой,
		|	Контрагент";	
	ИначеЕсли Группировка = "По позициям" Тогда
		ТекстГруппировка = ТекстГруппировка + 
	    "
		|ИТОГИ
		|	СУММА(СуммаБезНДС),
		|	СУММА(СуммаНДС),
		|	СУММА(СуммаНеоблагаемая),
		|	СУММА(Всего)
		|ПО
		|	ОБЩИЕ,
		|	СтавкаНДССтрокой,
		|	Номенклатура";
	ИначеЕсли Группировка = "По документам" Тогда
		ТекстГруппировка = ТекстГруппировка + 
	    "
		|ИТОГИ
		|	СУММА(СуммаБезНДС),
		|	СУММА(СуммаНДС),
		|	СУММА(СуммаНеоблагаемая),
		|	СУММА(Всего)
		|ПО
		|	ОБЩИЕ,
		|	СтавкаНДССтрокой,
		|	ДокументПоставки";		
	КонецЕсли;
	
	Запрос.Текст = ОсновнойТекстЗапроса + ТекстГруппировка;
	
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецПериода);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	РезультатЗапроса 		= Запрос.Выполнить();
	ВыборкаПоступлениеИтоги	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	ВывестиИтоги(ТабличныйДокумент, Макет, ВыборкаПоступлениеИтоги);
	ВыборкаПоступлениеИтоги.Сбросить();
	
	Пока ВыборкаПоступлениеИтоги.Следующий() Цикл		
		ВыборкаПоСтавке = ВыборкаПоступлениеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСтавке.Следующий() Цикл
			ОбластьГруппировка = Макет.ПолучитьОбласть("Группировка");
			ОбластьГруппировка.Параметры.Группировка = ВыборкаПоСтавке.СтавкаНДССтрокой;
			ОбластьГруппировка.Параметры.Заполнить(ВыборкаПоСтавке);
			ТабличныйДокумент.Вывести(ОбластьГруппировка, 2);
		
			ВыборкаПоКонтрагенту = ВыборкаПоСтавке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоКонтрагенту.Следующий() Цикл
				ОбластьКонтрагент = Макет.ПолучитьОбласть("Группировка");
				Если Группировка = "По контрагенту" ИЛИ НЕ ЗначениеЗаполнено(Группировка) Тогда
					ОбластьКонтрагент.Параметры.Группировка = ВыборкаПоКонтрагенту.Контрагент;
				ИначеЕсли Группировка = "По позициям" Тогда
					ОбластьКонтрагент.Параметры.Группировка = ВыборкаПоКонтрагенту.Номенклатура;
				ИначеЕсли Группировка = "По документам" Тогда
					ОбластьКонтрагент.Параметры.Группировка = ВыборкаПоКонтрагенту.ДокументПоставки;
				КонецЕсли;
				ОбластьКонтрагент.Параметры.Заполнить(ВыборкаПоКонтрагенту);
				ТабличныйДокумент.Вывести(ОбластьКонтрагент, 3);
				
				ВыборкаДетальныеЗаписиПоступление = ВыборкаПоКонтрагенту.Выбрать();			
				Пока ВыборкаДетальныеЗаписиПоступление.Следующий() Цикл
					ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");					
					ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаДетальныеЗаписиПоступление);
					ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы, 4);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);

	РезультатФормирования.Результат = ТабличныйДокумент;
	
КонецПроцедуры

Процедура ВывестиИтоги(ТабличныйДокумент, Макет, ВыборкаПоступлениеИтоги)

	Пока ВыборкаПоступлениеИтоги.Следующий() Цикл
		ОбластьГруппировка = Макет.ПолучитьОбласть("Итог");
		ОбластьГруппировка.Параметры.Заполнить(ВыборкаПоступлениеИтоги);
		ОбластьГруппировка.Параметры.Группировка = "Итог:";
		ТабличныйДокумент.Вывести(ОбластьГруппировка, 1);			
		
		ВыборкаПоСтавке = ВыборкаПоступлениеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСтавке.Следующий() Цикл
			ОбластьГруппировка = Макет.ПолучитьОбласть("Итог");
			ОбластьГруппировка.Параметры.Заполнить(ВыборкаПоСтавке);
			Если ВыборкаПоСтавке.СтавкаНДССтрокой = "Ставка НДС: Стандарт" Тогда
				ОбластьГруппировка.Параметры.Группировка = "в.ч. стоимость мат. ресурсов, приобретенных с НДС";
			ИначеЕсли ВыборкаПоСтавке.СтавкаНДССтрокой = "Ставка НДС: Без НДС" Тогда
				ОбластьГруппировка.Параметры.Группировка = "в.ч. стоимость мат. ресурсов, приобретенных без НДС";
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьГруппировка, 2);		
		КонецЦикла;
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
